tutorials/testcases/cavity/overset/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       2064;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          102;
        startFace       2094;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2160;
        startFace       2196;
    }
    lowerBellerophon
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          30;
        startFace       4356;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       upper;
    }
    upperBellerophon
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          30;
        startFace       4386;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       lower;
    }
)

// ************************************************************************* //
